tap "homebrew/bundle"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"

# 开发工具
brew "git"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "gh"
brew "go-task"  #taskfile
brew "tree"
brew "htop"
brew "fastfetch"
brew "fnm"  # node 版本管理
brew "uv"
brew "ollama"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "sdkman/tap/sdkman-cli"
brew "spring-io/tap/spring-boot"

# 语言和运行时
brew "go"
brew "python@3.12"
brew "rustup"
# Java 通过 SDKMAN 管理，不在这里安装

# 容器和云工具
brew "kubectl"
brew "kubectx"
brew "k9s"
brew "helm"
brew "docker"

# 网络工具
brew "httpie"
brew "nmap"

# 文件处理
brew "rename"
brew "findutils"
brew "coreutils"
brew "moreutils"

# GUI 应用
cask "1password"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea"
cask "orbstack"
cask "switchhosts"
cask "typora"
cask "ghostty"
cask "tinypng4mac"
cask "picgo"

# 通讯和办公
cask "wechat"
cask "feishu"

# 云存储
brew "aliyunpan"
cask "baidunetdisk"