# Brewfile — brew bundle install（https://docs.brew.sh/Manpage#bundle-subcommand）

# --- Taps ---
tap "farion1231/ccswitch" # cc-switch
tap "sdkman/tap"          # SDKMAN（Java/Maven 等）
tap "tw93/tap"            # Kaku

# --- 开发工具 ---
brew "gh"        # GitHub CLI
brew "fnm"       # Node 版本管理
brew "uv"        # Python 包/环境
brew "pandoc"    # 文档转换
brew "tableplus"

# --- 命令行（搜索、列表、编辑）---
brew "bash"          # 较新 bash
brew "bat"           # 带高亮的 cat
brew "eza"           # ls
brew "fd"            # find
brew "fzf"           # 模糊查找
brew "git-delta"     # diff 高亮
brew "gnupg"         # GPG
brew "jq"            # JSON
brew "just"          # 命令 runner（可与 go-task 并存）
brew "ripgrep"       # rg 搜索
brew "sd"            # sed 替代
brew "watchexec"     # 文件变更重跑命令
brew "wget"          # 下载
brew "yq"            # YAML

brew "chezmoi"       # 管理 dotfiles

# --- 命令行（数据、HTTP）---
brew "duckdb"        # 分析数据库 CLI
brew "xh"            # HTTP 客户端（与 httpie 同类，二选一即可）

# --- 命令行（语言与包管理）---
brew "node"          # Node
brew "python@3.14"   # Python 3.14
brew "pipx"          # 隔离安装 Python CLI
brew "pnpm"          # Node 包管理器
brew "sdkman-cli"    # sdk install java / maven
brew "aliyunpan"     # 阿里云盘 CLI

# --- 图形界面（cask）---
cask "1password"                     # 密码管理
cask "ayugram"                       # Telegram 客户端
cask "baidunetdisk"                  # 百度网盘
cask "claude-code"                   # Anthropic Claude Code
cask "codex"                         # OpenAI Codex（以实际 formula 为准）
cask "codex-app"                     # Codex 桌面端
cask "cursor"                        # Cursor 编辑器
cask "feishu"                        # 飞书
cask "google-chrome"                 # Chrome 浏览器
cask "insomnia"                      # API 调试
cask "intellij-idea"                 # IntelliJ IDEA
cask "orbstack"                      # 容器/轻量虚拟机
cask "switchhosts"                   # Hosts 切换
cask "typora"                        # Markdown 编辑器
cask "wechat"                        # 微信
cask "wetype"                        # 微信输入法
cask "tw93/tap/kakuku"               # Kaku 终端
cask "farion1231/ccswitch/cc-switch" # 代理环境切换（cc-switch）
