tap "farion1231/ccswitch"
tap "sdkman/tap"
brew "aliyunpan"
brew "bash"
brew "bat"
brew "chezmoi"
brew "duckdb"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "jq"
brew "just"
brew "mole"
brew "node"
brew "pandoc"
brew "python@3.14"
brew "pipx"
brew "pnpm"
brew "rclone"
brew "ripgrep"
brew "sd"
brew "sheldon"
brew "starship"
brew "tlrc"
brew "uv"
brew "watchexec"
brew "webp"
brew "wget"
brew "xh"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "sdkman/tap/sdkman-cli"
cask "1password"
cask "ayugram"
cask "baidunetdisk"
cask "farion1231/ccswitch/cc-switch"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "cursor"
cask "feishu"
cask "ghostty"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea"
cask "orbstack"
cask "switchhosts"
cask "tableplus"
cask "typora"
cask "wechat"
cask "wetype"
vscode "anysphere.remote-ssh"
